//////////////////////////////////////////////////////////////////////////////////	 
//
//  文 件 名   : main.c
//  功能描述   : OLED IIC (模拟IIC)接口演示例程
//              说明: 
//              ----------------------------------------------------------------
//              GND   电源地
//              VCC   接5V或3.3v电源
//              SCL   接PB13（SCL）
//              SDA   接PB15（SDA）            
//              ----------------------------------------------------------------
//******************************************************************************/

#include "delay.h"
#include "sys.h"
#include "oled.h"
#include "bmp.h"
 int main(void)
 {
//		delay_init();	    	     //延时函数初始化	  
//		NVIC_Configuration(); 	 //设置NVIC中断分组2:2位抢占优先级，2位响应优先级 	LED_Init();			     //LED端口初始化
		OLED_Init();			       //初始化OLED  
//		OLED_Clear(); 
	while(1) 
	{		
//		OLED_Clear();

//		OLED_ShowString(6,3,(uint8_t*)"stm32f103rb",100);//最后一个参数是字符的大小
//		delay_ms(1000);


		OLED_DrawBMP(0,0,128,8,BMP1);  //图片显示(图片显示慎用，生成的字表较大，会占用较多空间，FLASH空间8K以下慎用)
//		delay_ms(1000);

//		OLED_DrawBMP(0,0,128,8,BMP2);
//		delay_ms(8000);
//		delay_ms(8000);
	}	  
	
}

